using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;


namespace C
{
    public partial class RecipeDetailsForm : Form
    {
        public RecipeDetailsForm(string recipeName)
        {
            InitializeComponent();
            DisplayRecipe(recipeName);// نمایش دستور پخت غذا بر اساس نام غذا
        }


        // متدی که دستور پخت غذا را براساس نام غذا نمایش می‌دهد
        private void DisplayRecipe(string recipeName)
        {
            lblRecipeName.Text = recipeName; // نمایش نام غذا در لیبل

            // نمایش دستور پخت براساس نام غذا با استفاده از ساختار سویچ
            switch (recipeName)
            {
                // دستور پخت ماکارونی
                case "ماکارونی":
                    txtRecipeDetails.Text = "**مواد لازم**\r\n\r\nماکارونی: ۵۰۰ گرم\r\n\r\nگوشت چرخ کرده: ۳۰۰ گرم\r\n\r\nپیاز: ۲ عدد بزرگ\r\n\r\nرب گوجه‌فرنگی: ۲ قاشق غذاخوری\r\n\r\nنمک، فلفل، زردچوبه و آویشن: به مقدار لازم\r\n\r\nروغن: به مقدار لازم\r\n\r\nسیب زمینی: ۱ عدد بزرگ\r\n\r\n**دستور پخت**\r\n\r\nپیازها را خرد کرده و در روغن سرخ کنید تا طلایی شود\r\n\r\nگوشت چرخ کرده را اضافه کرده و تفت دهید تا رنگ آن تغییر کند\r\n\r\nرب گوجه‌فرنگی را اضافه کنید و با مواد مخلوط کنید\r\n\r\nنمک، فلفل، زردچوبه و آویشن را اضافه کنید و هم بزنید\r\n\r\nماکارونی‌ها را در آب جوش بریزید و طبق دستور روی بسته بپزید تا نرم شوند\r\n\r\nسیب زمینی را به صورت حلقه‌ای برش دهید و در ته قابلمه بچینید\r\n\r\nماکارونی‌های آبکش شده را با مواد گوشت و پیاز مخلوط کنید و در قابلمه روی سیب زمینی‌ها بریزید\r\n\r\nحرارت را کم کنید و بگذارید ماکارونی با بخار خود دم بکشد\r\n\r\nبعد از حدود ۳۰ دقیقه، ماکارونی ایرانی شما آماده است. نوش جان\r\n\r\n\r\n";
                    break;
                //دستور پخت قورمه سبزی
                case "قورمه سبزی":
                    txtRecipeDetails.Text = "**مواد لازم**\r\n\r\nگوشت گوسفندی: ۵۰۰ گرم\r\n\r\nسبزی قورمه (شامل تره، جعفری، گشنیز، شنبلیله و اسفناج): ۵۰۰ گرم\r\n\r\nلوبیا قرمز یا لوبیا چیتی: ۱ پیمانه\r\n\r\nپیاز: ۲ عدد بزرگ\r\n\r\nلیمو عمانی: ۳ عدد\r\n\r\nروغن: به مقدار لازم\r\n\r\nنمک، فلفل و زردچوبه: به مقدار لازم\r\n\r\n**دستور پخت**\r\n\r\nپیازها را خرد کرده و در روغن سرخ کنید تا طلایی شود\r\n\r\nگوشت را به قطعات کوچک تقسیم کنید و به پیاز اضافه کنید و تفت دهید تا رنگ آن تغییر کند\r\n\r\nلوبیاها را شسته و به مواد اضافه کنید و چند دقیقه تفت دهید\r\n\r\nسبزی‌های قورمه را شسته و خرد کرده و سرخ کنید، سپس به مواد اضافه کنید\r\n\r\nنمک، فلفل و زردچوبه را به مواد اضافه کنید و هم بزنید\r\n\r\n چهار لیوان آب به مواد اضافه کنید و بگذارید خورش با حرارت ملایم بپزد\r\n\r\nلیمو عمانی‌ها را با چنگال سوراخ کنید و به خورش اضافه کنید\r\n\r\nبگذارید خورش قورمه سبزی به آرامی بپزد و جا بیفتد\r\n\r\nاین خورش معمولاً با برنج سرو می‌شود. نوش جان\r\n";
                    break;
                //دستور پخت زرشک پلو
                case "زرشک پلو":
                    txtRecipeDetails.Text = "**مواد لازم**\r\n\r\nبرنج: ۳ پیمانه\r\n\r\nسینه مرغ: ۲ عدد\r\n\r\nزرشک: ۱ پیمانه\r\n\r\nپیاز: ۱ عدد بزرگ\r\n\r\nزعفران دم کرده: به مقدار لازم\r\n\r\nشکر: ۲ قاشق غذاخوری\r\n\r\nکره: به مقدار لازم\r\n\r\nنمک، فلفل و زردچوبه: به مقدار لازم\r\n\r\n**دستور پخت**\r\n\r\nپیاز را خرد کرده و در روغن سرخ کنید تا طلایی شود\r\n\r\nسینه مرغ را به قطعات کوچک تقسیم کرده و به پیاز اضافه کنید و تفت دهید تا رنگ آن تغییر کند\r\n\r\nنمک، فلفل و زردچوبه را اضافه کنید و با مواد مخلوط کنید\r\n\r\nمقداری آب به مواد اضافه کرده و بگذارید مرغ بپزد\r\n\r\nبرنج را شسته و با آب و نمک بگذارید خیس بخورد\r\n\r\nبرنج را بجوشانید و سپس آبکش کنید\r\n\r\nزرشک‌ها را شسته و در کره تفت دهید. شکر و زعفران دم کرده را به زرشک اضافه کنید و هم بزنید\r\n\r\nدر قابلمه‌ای کره آب کنید و برنج را به صورت لایه‌لایه با زرشک و مخلوط مرغ بچینید\r\n\r\nبرنج را دم کنید تا همه مواد به خوبی با هم مخلوط شوند و پخته شوند\r\n\r\nبعد از حدود ۳۰ دقیقه، زرشک پلوی شما آماده است. نوش جان\r\n\r\n";
                    break;
                // دستور پخت کوکو سبزی
                case "کوکو سبزی":
                    txtRecipeDetails.Text = "**مواد لازم**\r\n\r\nسبزی کوکو (شامل تره، جعفری، گشنیز و شوید): ۵۰۰ گرم\r\n\r\nتخم مرغ: ۴ عدد\r\n\r\nپیاز: ۱ عدد بزرگ\r\n\r\nآرد: ۲ قاشق غذاخوری\r\n\r\nنمک، فلفل و زردچوبه: به مقدار لازم\r\n\r\nروغن: به مقدار لازم\r\n\r\n**دستور پخت**\r\n\r\nسبزی‌ها را شسته و خرد کنید\r\n\r\nپیاز را رنده کرده و با سبزی‌ها مخلوط کنید\r\n\r\nتخم‌مرغ‌ها را اضافه کنید و خوب هم بزنید\r\n\r\nآرد، نمک، فلفل و زردچوبه را به مخلوط اضافه کرده و هم بزنید تا یکدست شود\r\n\r\nروغن را در تابه بریزید و گرم کنید\r\n\r\nمخلوط کوکو را در تابه بریزید و سطح آن را صاف کنید\r\n\r\nبا حرارت متوسط بگذارید کوکو سرخ شود تا طرف پایین آن طلایی و برشته شود\r\n\r\nکوکو را برش زده و هر قطعه را برگردانید تا طرف دیگر آن نیز سرخ شود\r\n\r\nبعد از حدود ۱۵ دقیقه، کوکو سبزی شما آماده است. نوش جان\r\n\r\n";
                    break;
                //دستور پخت کوکو سیب زمینی
                case "کوکو سیب زمینی":
                    txtRecipeDetails.Text = "**مواد لازم**\r\n\r\nسیب‌زمینی: ۵۰۰ گرم\r\n\r\nتخم‌مرغ: ۳ عدد\r\n\r\nپیاز: ۱ عدد بزرگ\r\n\r\nآرد: ۲ قاشق غذاخوری\r\n\r\nنمک، فلفل و زردچوبه: به مقدار لازم\r\n\r\nروغن: به مقدار لازم\r\n\r\n**دستور پخت**\r\n\r\nسیب‌زمینی‌ها را شسته و پوست بگیرید، سپس رنده کنید\r\n\r\nپیاز را رنده کرده و با سیب‌زمینی‌های رنده شده مخلوط کنید\r\n\r\nتخم‌مرغ‌ها را اضافه کنید و خوب هم بزنید\r\n\r\nآرد، نمک، فلفل و زردچوبه را به مخلوط اضافه کرده و هم بزنید تا یکدست شود\r\n\r\nروغن را در تابه بریزید و گرم کنید\r\n\r\nمخلوط کوکو را در تابه بریزید و سطح آن را صاف کنید\r\n\r\nبا حرارت متوسط بگذارید کوکو سرخ شود تا طرف پایین آن طلایی و برشته شود\r\n\r\nکوکو را برش زده و هر قطعه را برگردانید تا طرف دیگر آن نیز سرخ شود\r\n\r\nبعد از حدود ۱۵ دقیقه، کوکو سیب زمینی شما آماده است. نوش جان\r\n\r\n\r\n";
                    break;
                //دستور پخت آبگوشت
                case "آبگوشت":
                    txtRecipeDetails.Text = "**مواد لازم**\r\n\r\nگوشت گوسفندی: ۵۰۰ گرم\r\n\r\nنخود و لوبیا: ۱ پیمانه\r\n\r\nسیب‌زمینی: ۲ عدد بزرگ\r\n\r\nپیاز: ۱ عدد بزرگ\r\n\r\nگوجه‌فرنگی: ۲ عدد\r\n\r\nرب گوجه‌فرنگی: ۲ قاشق غذاخوری\r\n\r\nلیمو عمانی: ۲ عدد\r\n\r\nنمک، فلفل، زردچوبه و دارچین: به مقدار لازم\r\n\r\nروغن: به مقدار لازم\r\n\r\nنان سنگک: به مقدار لازم\r\n\r\n**دستور پخت**\r\n\r\nحبوبات را از شب قبل خیس کنید\r\n\r\nپیاز را خرد کرده و در روغن سرخ کنید تا طلایی شود\r\n\r\nگوشت را به قطعات بزرگ تقسیم کرده و به پیاز اضافه کنید و تفت دهید تا رنگ آن تغییر کند\r\n\r\nحبوبات، گوجه‌فرنگی خرد شده و رب گوجه‌فرنگی را اضافه کنید و مخلوط کنید\r\n\r\nنمک، فلفل، زردچوبه و دارچین را به مواد اضافه کنید و هم بزنید\r\n\r\nحدود ۶ لیوان آب به مواد اضافه کنید و بگذارید با حرارت ملایم بپزد\r\n\r\nسیب‌زمینی‌ها را پوست گرفته و درسته به مواد اضافه کنید\r\n\r\nلیمو عمانی‌ها را با چنگال سوراخ کنید و به خورش اضافه کنید\r\n\r\nبگذارید آبگوشت به آرامی بپزد و جا بیفتد\r\n\r\nآبگوشت را می‌توانید با نان سنگک سرو کنید. نوش جان\r\n\r\n\r\n";
                    break;
                //دستور پخت آش رشته
                case "آش رشته":
                    txtRecipeDetails.Text = "\r\n\r\n\r\n\r\n**مواد لازم**\r\n\r\nنخود و لوبیا (ترجیحاً لوبیا چیتی): ۱ پیمانه\r\n\r\nعدس: ۱ پیمانه\r\n\r\nسبزی آش (شامل تره، جعفری، گشنیز و اسفناج): ۵۰۰ گرم\r\n\r\nرشته آش: ۲۵۰ گرم\r\n\r\nپیاز: ۲ عدد بزرگ\r\n\r\nسیر: ۳ حبه\r\n\r\nنعناع خشک: ۲ قاشق غذاخوری\r\n\r\nکشک: به مقدار لازم\r\n\r\nنمک، فلفل و زردچوبه: به مقدار لازم\r\n\r\nروغن: به مقدار لازم\r\n\r\n**دستور پخت**\r\n\r\nحبوبات را از شب قبل خیس کنید و سپس با مقداری آب بپزید تا نرم شوند\r\n\r\nپیازها را خرد کرده و در روغن سرخ کنید تا طلایی شود. نیمی از پیازهای سرخ شده را برای تزئین کنار بگذارید\r\n\r\nسیرها را خرد کرده و با پیازهای باقی‌مانده تفت دهید\r\n\r\nسبزی‌های خرد شده را به پیاز و سیر اضافه کرده و کمی تفت دهید\r\n\r\nحبوبات پخته شده را به مواد اضافه کنید و با مقداری آب بگذارید بجوشند\r\n\r\nعدس را اضافه کنید و بگذارید نیم‌پز شود\r\n\r\nرشته‌ها را شکسته و به آش اضافه کنید و هم بزنید تا رشته‌ها نرم شوند\r\n\r\nنمک، فلفل و زردچوبه را به آش اضافه کنید\r\n\r\nدر پایان، نعناع خشک را در کمی روغن سرخ کرده و به آش اضافه کنید\r\n\r\nآش را با کشک، نعناع داغ، پیاز داغ و سیر داغ تزئین کرده و سرو کنید.نوش جان\r\n";
                    break;
                //دستور پخت کتلت
                case "کتلت":
                    txtRecipeDetails.Text = "**مواد لازم**\r\n\r\nگوشت چرخ کرده: ۳۰۰ گرم\r\n\r\nسیب زمینی: ۳ عدد متوسط\r\n\r\nپیاز: ۱ عدد بزرگ\r\n\r\nتخم مرغ: ۱ عدد\r\n\r\nآرد سوخاری: ۲ قاشق غذاخوری\r\n\r\nنمک، فلفل و زردچوبه: به مقدار لازم\r\n\r\nروغن: به مقدار لازم\r\n\r\n**دستور پخت**\r\n\r\nسیب زمینی‌ها را شسته و پوست بگیرید، سپس رنده کنید\r\n\r\nپیاز را رنده کرده و با سیب زمینی‌های رنده شده مخلوط کنید\r\n\r\nگوشت چرخ کرده را اضافه کنید و خوب هم بزنید\r\n\r\nتخم مرغ، آرد سوخاری، نمک، فلفل و زردچوبه را به مخلوط اضافه کرده و هم بزنید تا یکدست شود\r\n\r\nروغن را در تابه بریزید و گرم کنید\r\n\r\nاز مخلوط کتلت به اندازه توپ‌های کوچک برداشته و به شکل بیضی یا گرد درآورید و در روغن سرخ کنید\r\n\r\nبا حرارت متوسط بگذارید کتلت‌ها سرخ شوند تا طرف پایین آن طلایی و برشته شود\r\n\r\nکتلت‌ها را برگردانید تا طرف دیگر آن نیز سرخ شود\r\n\r\nبعد از حدود ۱۵ دقیقه، کتلت‌های خوشمزه شما آماده است. نوش جان\r\n";
                    break;
                //دستور پختت قیمه
                case "قیمه":
                    txtRecipeDetails.Text = "**مواد لازم**\r\n\r\nگوشت گوسفندی: 500 گرم\r\n\r\nلپه: 1 پیمانه\r\n\r\nپیاز: 2 عدد بزرگ\r\n\r\nرب گوجه‌فرنگی: 2 قاشق غذاخوری\r\n\r\nزعفران: به مقدار لازم\r\n\r\nلیمو عمانی: 3 عدد\r\n\r\nروغن: به مقدار لازم\r\n\r\nنمک، فلفل و زردچوبه: به مقدار لازم\r\n\r\n**دستور پخت**\r\n\r\nپیازها را خرد کرده و در روغن سرخ کنید تا طلایی شود\r\n\r\nگوشت را به قطعات کوچک تقسیم کنید و به پیاز اضافه کنید و تفت دهید تا رنگ آن تغییر کند\r\n\r\nلپه‌ها را شسته و به مواد اضافه کنید و چند دقیقه تفت دهید\r\n\r\nرب گوجه‌فرنگی را اضافه کنید و با مواد مخلوط کنید\r\n\r\nزردچوبه، فلفل و نمک را به مواد اضافه کنید و هم بزنید\r\n\r\nالی ۴ لیوان آب به مواد اضافه کنید و بگذارید خورش با حرارت ملایم بپزد\r\n\r\nلیمو عمانی‌ها را با چنگال سوراخ کنید و به خورش اضافه کنید\r\n\r\nدر انتهای پخت زعفران دم کرده را اضافه کنید و بگذارید خورش قیمه جا بیفتد\r\n\r\nاین خورش معمولاً با برنج سرو می‌شود. نوش جان\r\n\r\n\r\n";
                    break;
                //دستور پخت استانبولی
                case "استانبولی":
                    txtRecipeDetails.Text = "**مواد لازم**\r\n\r\nبرنج: ۳ پیمانه\r\n\r\nسیب زمینی: ۲ عدد متوسط\r\n\r\nگوجه‌فرنگی: ۳ عدد\r\n\r\nپیاز: ۱ عدد بزرگ\r\n\r\nرب گوجه‌فرنگی: ۲ قاشق غذاخوری\r\n\r\nنمک، فلفل و زردچوبه: به مقدار لازم\r\n\r\nروغن: به مقدار لازم\r\n\r\n**دستور پخت**\r\n\r\nپیاز را خرد کرده و در روغن سرخ کنید تا طلایی شود\r\n\r\nسیب زمینی‌ها را به صورت مکعبی خرد کنید و به پیاز اضافه کنید و تفت دهید تا نیمه‌پز شوند\r\n\r\nگوجه‌فرنگی‌ها را پوست گرفته و خرد کنید، سپس به مواد اضافه کنید\r\n\r\nرب گوجه‌فرنگی را اضافه کنید و با مواد مخلوط کنید\r\n\r\nنمک، فلفل و زردچوبه را به مواد اضافه کنید و هم بزنید\r\n\r\nبرنج را شسته و به مواد اضافه کنید\r\n\r\nمقداری آب به مواد اضافه کنید تا برنج بپزد\r\n\r\nبگذارید برنج با حرارت ملایم بپزد و آب آن جذب شود\r\n\r\nبعد از حدود ۳۰ دقیقه، استانبولی خوشمزه شما آماده است. نوش جان\r\n\r\n\r\n";
                    break;
                // در صورتی که نام غذا شناخته شده نباشد
                default:
                    txtRecipeDetails.Text = "دستور پخت در دسترس نیست.";
                    break;
            }
        }

        private void btnBack_Click(object sender, EventArgs e)
        {
            //برای بازگشت به فرم قبلی و ایجاد یک نمونه جدید از فرم
            RecipeForm recipeForm = new RecipeForm(); 
            //نمایش فرمی که نوشتم
            recipeForm.Show();
            //بستن فرم جاری
            this.Close();
        }

        private void RecipeDetailsForm_Load(object sender, EventArgs e)
        {

        }
    }
}
